---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DocumentFailures.CannotAutoUpdate
source: html/7a9a21b1-2725-d63b-9b9c-284c110cc4d2.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DocumentFailures.CannotAutoUpdate Property

Coordination Monitor can't update element

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotAutoUpdate { get; }
```